{
  "ir_version": "1.0",
  "gate_id": "bcbsma_documentation_requirement_049_drug_management_retail_pharmacy_prior_authorization_policy",
  "gate_type": "bitmask_gate",
  "input_schema": {
    "features": [
      {
        "id": "requirement__req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-002__satisfied",
        "type": "float",
        "description": null,
        "values": null,
        "min": null,
        "max": null,
        "editable": null,
        "semantics": {
          "label": "Historical documentation requirement",
          "source_id": "req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-002",
          "source_anchor": "sample_policy_dual_documentation_check:p1-002",
          "states": {
            "missing_at_or_below_zero": {
              "when": {
                "op": "<=",
                "value": 0
              },
              "label": "Historical documentation requirement is missing",
              "message": "This rule fires when the packet does not support historical documentation requirement.",
              "counterfactual_hint": "Add evidence showing historical documentation requirement."
            },
            "missing_below_one": {
              "when": {
                "op": "<",
                "value": 1
              },
              "label": "Historical documentation requirement is missing",
              "message": "This rule fires when the packet does not support historical documentation requirement.",
              "counterfactual_hint": "Add evidence showing historical documentation requirement."
            },
            "incomplete_at_or_below_half": {
              "when": {
                "op": "<=",
                "value": 0.5
              },
              "label": "Historical documentation requirement support is incomplete",
              "message": "This rule fires when the packet only partially supports historical documentation requirement.",
              "counterfactual_hint": "Add complete evidence showing historical documentation requirement."
            },
            "missing_equals_zero": {
              "when": {
                "op": "==",
                "value": 0
              },
              "label": "Historical documentation requirement is missing",
              "message": "This rule fires when the packet does not support historical documentation requirement.",
              "counterfactual_hint": "Add evidence showing historical documentation requirement."
            }
          }
        }
      },
      {
        "id": "requirement__req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-008__satisfied",
        "type": "float",
        "description": null,
        "values": null,
        "min": null,
        "max": null,
        "editable": null,
        "semantics": {
          "label": "Genetic test support",
          "source_id": "req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-008",
          "source_anchor": "sample_policy_dual_documentation_check:p1-008",
          "states": {
            "missing_at_or_below_zero": {
              "when": {
                "op": "<=",
                "value": 0
              },
              "label": "Genetic test support is missing",
              "message": "This rule fires when the packet does not support genetic test support.",
              "counterfactual_hint": "Add evidence showing genetic test support."
            },
            "missing_below_one": {
              "when": {
                "op": "<",
                "value": 1
              },
              "label": "Genetic test support is missing",
              "message": "This rule fires when the packet does not support genetic test support.",
              "counterfactual_hint": "Add evidence showing genetic test support."
            },
            "incomplete_at_or_below_half": {
              "when": {
                "op": "<=",
                "value": 0.5
              },
              "label": "Genetic test support support is incomplete",
              "message": "This rule fires when the packet only partially supports genetic test support.",
              "counterfactual_hint": "Add complete evidence showing genetic test support."
            },
            "missing_equals_zero": {
              "when": {
                "op": "==",
                "value": 0
              },
              "label": "Genetic test support is missing",
              "message": "This rule fires when the packet does not support genetic test support.",
              "counterfactual_hint": "Add evidence showing genetic test support."
            }
          }
        }
      }
    ]
  },
  "rules": [
    {
      "id": "missing_req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-002",
      "kind": "predicate",
      "bit": 0,
      "deny_when": {
        "feature": "requirement__req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-002__satisfied",
        "op": "<=",
        "value": 0.5
      },
      "label": "Historical documentation requirement support is incomplete",
      "message": "This rule fires when the packet only partially supports historical documentation requirement.",
      "severity": null,
      "counterfactual_hint": "Add complete evidence showing historical documentation requirement.",
      "verification_status": "heuristic_unverified"
    },
    {
      "id": "missing_req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-008",
      "kind": "predicate",
      "bit": 1,
      "deny_when": {
        "feature": "requirement__req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-008__satisfied",
        "op": "<=",
        "value": 0.5
      },
      "label": "Genetic test support support is incomplete",
      "message": "This rule fires when the packet only partially supports genetic test support.",
      "severity": null,
      "counterfactual_hint": "Add complete evidence showing genetic test support.",
      "verification_status": "heuristic_unverified"
    }
  ],
  "evaluation": {
    "combine": "bitwise_or",
    "allow_when_bitmask": 0
  },
  "verification": {
    "domain_constraints": null,
    "correctness_scope": "draft healthcare policy requirement gate",
    "verification_summary": null
  },
  "provenance": {
    "generator": "logicpearl.healthcare_policy_compiler",
    "generator_version": "0.1.0",
    "source_commit": null,
    "created_at": null
  }
}
