{
  "ir_version": "1.0",
  "gate_id": "membership_demo_v1",
  "gate_type": "bitmask_gate",
  "input_schema": {
    "features": [
      {
        "id": "age",
        "type": "int",
        "description": null,
        "values": null,
        "min": null,
        "max": null,
        "editable": null
      },
      {
        "id": "is_member",
        "type": "int",
        "description": null,
        "values": null,
        "min": null,
        "max": null,
        "editable": null
      }
    ]
  },
  "rules": [
    {
      "id": "rule_000",
      "kind": "predicate",
      "bit": 0,
      "deny_when": {
        "feature": "age",
        "op": "<=",
        "value": 17.0
      },
      "label": null,
      "message": null,
      "severity": null,
      "counterfactual_hint": null,
      "verification_status": "pipeline_unverified"
    }
  ],
  "evaluation": {
    "combine": "bitwise_or",
    "allow_when_bitmask": 0
  },
  "verification": {
    "domain_constraints": null,
    "correctness_scope": "training parity against 12 decision traces",
    "verification_summary": {
      "pipeline_unverified": 1
    }
  },
  "provenance": {
    "generator": "logicpearl.build",
    "generator_version": "0.1.0",
    "source_commit": null,
    "created_at": null
  }
}
