{
  "ir_version": "1.0",
  "gate_id": "route_status",
  "gate_type": "bitmask_gate",
  "input_schema": {
    "features": [
      {
        "id": "injection_payload_bitmask",
        "type": "int"
      },
      {
        "id": "sensitive_surface_bitmask",
        "type": "int"
      },
      {
        "id": "has_scanner_fingerprint",
        "type": "bool"
      },
      {
        "id": "has_malformed_encoding",
        "type": "bool"
      },
      {
        "id": "risk_score",
        "type": "float"
      },
      {
        "id": "likely_benign_request",
        "type": "bool"
      }
    ]
  },
  "rules": [
    {
      "id": "deny_if_any_prior_waf_family_fired",
      "kind": "predicate",
      "bit": 0,
      "deny_when": {
        "any": [
          {
            "feature": "injection_payload_bitmask",
            "op": ">",
            "value": 0
          },
          {
            "feature": "sensitive_surface_bitmask",
            "op": ">",
            "value": 0
          }
        ]
      },
      "message": "One or more edge WAF families fired."
    },
    {
      "id": "review_suspicious_probe",
      "kind": "predicate",
      "bit": 1,
      "deny_when": {
        "all": [
          {
            "any": [
              {
                "feature": "has_scanner_fingerprint",
                "op": "==",
                "value": true
              },
              {
                "feature": "has_malformed_encoding",
                "op": "==",
                "value": true
              }
            ]
          },
          {
            "feature": "risk_score",
            "op": ">=",
            "value": 0.55
          },
          {
            "feature": "likely_benign_request",
            "op": "==",
            "value": false
          }
        ]
      },
      "message": "Scanner-like or malformed high-risk requests are routed for review."
    }
  ],
  "evaluation": {
    "combine": "bitwise_or",
    "allow_when_bitmask": 0
  },
  "verification": {
    "correctness_scope": "Example WAF edge route pearl."
  },
  "provenance": {
    "generator": "logicpearl.waf_edge_example",
    "generator_version": "0.1.1"
  }
}
