{
  "ir_version": "1.0",
  "gate_id": "bcbsma_conservative_therapy_prereq_003_transcutaneous_electrical_nerve_stimulation_prn",
  "gate_type": "bitmask_gate",
  "input_schema": {
    "features": [
      {
        "id": "requirement__req-003-transcutaneous-electrical-nerve-stimulation-prn-p1-001__satisfied",
        "type": "float",
        "description": null,
        "values": null,
        "min": null,
        "max": null,
        "editable": null,
        "semantics": {
          "label": "Failed conservative therapy",
          "source_id": "req-003-transcutaneous-electrical-nerve-stimulation-prn-p1-001",
          "source_anchor": "sample_policy_single_conservative_check:p1-001",
          "states": {
            "missing_at_or_below_zero": {
              "when": {
                "op": "<=",
                "value": 0
              },
              "label": "Failed conservative therapy is missing",
              "message": "This rule fires when the packet does not support failed conservative therapy.",
              "counterfactual_hint": "Add evidence showing failed conservative therapy."
            },
            "missing_below_one": {
              "when": {
                "op": "<",
                "value": 1
              },
              "label": "Failed conservative therapy is missing",
              "message": "This rule fires when the packet does not support failed conservative therapy.",
              "counterfactual_hint": "Add evidence showing failed conservative therapy."
            },
            "incomplete_at_or_below_half": {
              "when": {
                "op": "<=",
                "value": 0.5
              },
              "label": "Failed conservative therapy support is incomplete",
              "message": "This rule fires when the packet only partially supports failed conservative therapy.",
              "counterfactual_hint": "Add complete evidence showing failed conservative therapy."
            },
            "missing_equals_zero": {
              "when": {
                "op": "==",
                "value": 0
              },
              "label": "Failed conservative therapy is missing",
              "message": "This rule fires when the packet does not support failed conservative therapy.",
              "counterfactual_hint": "Add evidence showing failed conservative therapy."
            }
          }
        }
      }
    ]
  },
  "rules": [
    {
      "id": "missing_req-003-transcutaneous-electrical-nerve-stimulation-prn-p1-001",
      "kind": "predicate",
      "bit": 0,
      "deny_when": {
        "feature": "requirement__req-003-transcutaneous-electrical-nerve-stimulation-prn-p1-001__satisfied",
        "op": "<=",
        "value": 0
      },
      "label": "Failed conservative therapy is missing",
      "message": "This rule fires when the packet does not support failed conservative therapy.",
      "severity": null,
      "counterfactual_hint": "Add evidence showing failed conservative therapy.",
      "verification_status": "pipeline_unverified"
    }
  ],
  "evaluation": {
    "combine": "bitwise_or",
    "allow_when_bitmask": 0
  },
  "verification": {
    "domain_constraints": null,
    "correctness_scope": "training parity against 3 decision traces",
    "verification_summary": {
      "pipeline_unverified": 1
    }
  },
  "provenance": {
    "generator": "logicpearl.build",
    "generator_version": "0.1.0",
    "source_commit": null,
    "created_at": null
  }
}
