{
  "ir_version": "1.0",
  "gate_id": "bcbsma_step_therapy_049_drug_management_retail_pharmacy_prior_authorization_policy",
  "gate_type": "bitmask_gate",
  "input_schema": {
    "features": [
      {
        "id": "requirement__req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-001__satisfied",
        "type": "float",
        "description": null,
        "values": null,
        "min": null,
        "max": null,
        "editable": null,
        "semantics": {
          "label": "Prior medication trial",
          "source_id": "req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-001",
          "source_anchor": "sample_policy_dual_step_therapy_check:p1-001",
          "states": {
            "missing_at_or_below_zero": {
              "when": {
                "op": "<=",
                "value": 0
              },
              "label": "Prior medication trial is missing",
              "message": "This rule fires when the packet does not support prior medication trial.",
              "counterfactual_hint": "Add evidence showing prior medication trial."
            },
            "missing_below_one": {
              "when": {
                "op": "<",
                "value": 1
              },
              "label": "Prior medication trial is missing",
              "message": "This rule fires when the packet does not support prior medication trial.",
              "counterfactual_hint": "Add evidence showing prior medication trial."
            },
            "incomplete_at_or_below_half": {
              "when": {
                "op": "<=",
                "value": 0.5
              },
              "label": "Prior medication trial support is incomplete",
              "message": "This rule fires when the packet only partially supports prior medication trial.",
              "counterfactual_hint": "Add complete evidence showing prior medication trial."
            },
            "missing_equals_zero": {
              "when": {
                "op": "==",
                "value": 0
              },
              "label": "Prior medication trial is missing",
              "message": "This rule fires when the packet does not support prior medication trial.",
              "counterfactual_hint": "Add evidence showing prior medication trial."
            }
          }
        }
      },
      {
        "id": "requirement__req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-003__satisfied",
        "type": "float",
        "description": null,
        "values": null,
        "min": null,
        "max": null,
        "editable": null,
        "semantics": {
          "label": "Formulary alternative trial",
          "source_id": "req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-003",
          "source_anchor": "sample_policy_dual_step_therapy_check:p1-003",
          "states": {
            "missing_at_or_below_zero": {
              "when": {
                "op": "<=",
                "value": 0
              },
              "label": "Formulary alternative trial is missing",
              "message": "This rule fires when the packet does not support formulary alternative trial.",
              "counterfactual_hint": "Add evidence showing formulary alternative trial."
            },
            "missing_below_one": {
              "when": {
                "op": "<",
                "value": 1
              },
              "label": "Formulary alternative trial is missing",
              "message": "This rule fires when the packet does not support formulary alternative trial.",
              "counterfactual_hint": "Add evidence showing formulary alternative trial."
            },
            "incomplete_at_or_below_half": {
              "when": {
                "op": "<=",
                "value": 0.5
              },
              "label": "Formulary alternative trial support is incomplete",
              "message": "This rule fires when the packet only partially supports formulary alternative trial.",
              "counterfactual_hint": "Add complete evidence showing formulary alternative trial."
            },
            "missing_equals_zero": {
              "when": {
                "op": "==",
                "value": 0
              },
              "label": "Formulary alternative trial is missing",
              "message": "This rule fires when the packet does not support formulary alternative trial.",
              "counterfactual_hint": "Add evidence showing formulary alternative trial."
            }
          }
        }
      }
    ]
  },
  "rules": [
    {
      "id": "missing_req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-001",
      "kind": "predicate",
      "bit": 0,
      "deny_when": {
        "feature": "requirement__req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-001__satisfied",
        "op": "<",
        "value": 1
      },
      "label": "Prior medication trial is missing",
      "message": "This rule fires when the packet does not support prior medication trial.",
      "severity": null,
      "counterfactual_hint": "Add evidence showing prior medication trial.",
      "verification_status": "pipeline_unverified"
    },
    {
      "id": "missing_req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-003",
      "kind": "predicate",
      "bit": 1,
      "deny_when": {
        "feature": "requirement__req-049-drug-management-retail-pharmacy-prior-authorization-policy-p1-003__satisfied",
        "op": "<=",
        "value": 0
      },
      "label": "Formulary alternative trial is missing",
      "message": "This rule fires when the packet does not support formulary alternative trial.",
      "severity": null,
      "counterfactual_hint": "Add evidence showing formulary alternative trial.",
      "verification_status": "pipeline_unverified"
    }
  ],
  "evaluation": {
    "combine": "bitwise_or",
    "allow_when_bitmask": 0
  },
  "verification": {
    "domain_constraints": null,
    "correctness_scope": "training parity against 4 decision traces",
    "verification_summary": {
      "pipeline_unverified": 2
    }
  },
  "provenance": {
    "generator": "logicpearl.build",
    "generator_version": "0.1.0",
    "source_commit": null,
    "created_at": null
  }
}
