{
  "ir_version": "1.0",
  "gate_id": "bcbsma_documentation_requirement_004_immune_modulating_drugs_prn",
  "gate_type": "bitmask_gate",
  "input_schema": {
    "features": [
      {
        "id": "requirement__req-004-immune-modulating-drugs-prn-p6-010__satisfied",
        "type": "float",
        "description": null,
        "values": null,
        "min": null,
        "max": null,
        "editable": null,
        "semantics": {
          "label": "Clinical documentation",
          "source_id": "req-004-immune-modulating-drugs-prn-p6-010",
          "source_anchor": "sample_policy_single_documentation_check:p6-010",
          "states": {
            "missing_at_or_below_zero": {
              "when": {
                "op": "<=",
                "value": 0
              },
              "label": "Clinical documentation is missing",
              "message": "This rule fires when the packet does not support clinical documentation.",
              "counterfactual_hint": "Add evidence showing clinical documentation."
            },
            "missing_below_one": {
              "when": {
                "op": "<",
                "value": 1
              },
              "label": "Clinical documentation is missing",
              "message": "This rule fires when the packet does not support clinical documentation.",
              "counterfactual_hint": "Add evidence showing clinical documentation."
            },
            "incomplete_at_or_below_half": {
              "when": {
                "op": "<=",
                "value": 0.5
              },
              "label": "Clinical documentation support is incomplete",
              "message": "This rule fires when the packet only partially supports clinical documentation.",
              "counterfactual_hint": "Add complete evidence showing clinical documentation."
            },
            "missing_equals_zero": {
              "when": {
                "op": "==",
                "value": 0
              },
              "label": "Clinical documentation is missing",
              "message": "This rule fires when the packet does not support clinical documentation.",
              "counterfactual_hint": "Add evidence showing clinical documentation."
            }
          }
        }
      }
    ]
  },
  "rules": [
    {
      "id": "missing_req-004-immune-modulating-drugs-prn-p6-010",
      "kind": "predicate",
      "bit": 0,
      "deny_when": {
        "feature": "requirement__req-004-immune-modulating-drugs-prn-p6-010__satisfied",
        "op": "<=",
        "value": 0.5
      },
      "label": "Clinical documentation support is incomplete",
      "message": "This rule fires when the packet only partially supports clinical documentation.",
      "severity": null,
      "counterfactual_hint": "Add complete evidence showing clinical documentation.",
      "verification_status": "heuristic_unverified"
    }
  ],
  "evaluation": {
    "combine": "bitwise_or",
    "allow_when_bitmask": 0
  },
  "verification": {
    "domain_constraints": null,
    "correctness_scope": "draft healthcare policy requirement gate",
    "verification_summary": null
  },
  "provenance": {
    "generator": "logicpearl.healthcare_policy_compiler",
    "generator_version": "0.1.0",
    "source_commit": null,
    "created_at": null
  }
}
